Ran Plan for 2 projects:

1. dir: `.` workspace: `default`
1. dir: `server-config` workspace: `default`

### 1. dir: `.` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ssm_parameter.atlantis will be created
+ resource "aws_ssm_parameter" "atlantis" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "atlantis-default"
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Provider source not supported in Terraform v0.12

  on main.tf line 7, in terraform:
   7:     aws = {
   8:       source  = "hashicorp/aws"
   9:       version = "~> 3.0"
  10:     }

A source was declared for provider aws. Terraform v0.12 does not support the
provider source attribute. It will be ignored.


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---
### 2. dir: `server-config` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/Users/paulzietsman/.atlantis/bin/terraform0.12.0 init -input=false -no-color -upgrade" in "/Users/paulzietsman/.atlantis/repos/phzietsman/atlantis-example/8/default/server-config": exit status 1
There are some problems with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Argument or block definition required

  on atlantis_backend.tmpl.tf line 2, in terraform:
   2:   backend \"s3\" {

An argument or block definition is required here. To set an argument, use the
equals sign "=" to introduce the argument value.


Error: Invalid character

  on atlantis_backend.tmpl.tf line 2, in terraform:
   2:   backend \"s3\" {

This character is not used within the language.


Error: Invalid multi-line string

  on atlantis_backend.tmpl.tf line 2, in terraform:
   2: 
   3: 

Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.


Error: Invalid multi-line string

  on atlantis_backend.tmpl.tf line 3, in terraform:
   3: 
   4: 

Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.


Error: Invalid multi-line string

  on atlantis_backend.tmpl.tf line 4, in terraform:
   4: 
   5: 

Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.


Error: Invalid multi-line string

  on atlantis_backend.tmpl.tf line 5, in terraform:
   5: 
   6: 

Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.


Error: Invalid multi-line string

  on atlantis_backend.tmpl.tf line 6, in terraform:
   6: 
   7: 

Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.


```
</details>

---

